cf_billing/Documents/энргАктНесанкционированногоПодключенияВмешательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргАктНесанкционированногоПодключенияВмешательства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргОбъемСубсидий</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачислений</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачисленийПомещенийСРазделеннымиЛС</xr:Item>
				<xr:Item>AccumulationRegister.энргНачисленныйСреднийОбъем</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПотребления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПотребления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МощностьПодключаемогоОборудования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьМощностьПодключаемогоОборудования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеИспользованияТУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючНорматива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиНормативов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПотребителей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рассчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРЭК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДатыПоверкиПрибораУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДатыПоверкиПрибораУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУчетаАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОДН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргАктНесанкционированногоПодключенияВмешательства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	ЕстьЗначенияЗаполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		 ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		Основание				= Неопределено;
		Если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргАктНесанкционированногоПодключенияВмешательства", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргАктНесанкционированногоПодключенияВмешательства", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗАполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= энргРаботаСВидамиОперацийСервер.ПрефиксФормы("энргАктНесанкционированногоПодключенияВмешательства", ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.энргФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента"	, "энргАктНесанкционированногоПодключенияВмешательства");
			Параметры.вставить("ВыборОперации"	, Истина);
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеТаблицыДней

Функция ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ТаблицаДней, ДопПараметры) Экспорт 
	ГраницыНачалаПериодаНачисления 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(ДопПараметры.Организация,ДопПараметры.Район,ДопПараметры.НачалоПериодаНачислений,Ложь);		
	ПериодС                         	= ДопПараметры.ПериодС;
	ПериодПо                        	= ДопПараметры.ПериодПо; 	
	
	НоваяСтрока 						= ТаблицаДней.Добавить();
	НоваяСтрока.ПериодНачисления 		= ДопПараметры.НачалоПериодаНачислений;
	НоваяСтрока.ЗавершениеОП 			= ГраницыНачалаПериодаНачисления.ЗавершениеОП;
	
	
	ДниПервогоПериод 					= РассчитатьКолвоДней(ПериодС, ГраницыНачалаПериодаНачисления.НачалоОП);
	ДниВторогоПериода 					= РассчитатьКолвоДней(ГраницыНачалаПериодаНачисления.ЗавершениеОП, НачалоДня((КонецДня(ПериодПо) + 1)));
	НоваяСтрока.КоличествоДнейРаботы 	= ДниПервогоПериод + ДниВторогоПериода;	
КонецФункции

Функция ДобавитьЗаписиПриОтсутствииБольшеОдногоПериодаНачислений(ТаблицаДней, ДопПараметры, ПерваяСтрока) Экспорт
	
	Организация						= ДопПараметры.Организация;
	Район							= ДопПараметры.Район;
	ПериодС                         = ДопПараметры.ПериодС;
	ПериодПо                        = ДопПараметры.ПериодПо;
	НачалоПериодаНачислений 		= ДопПараметры.НачалоПериодаНачислений;
	КонецПериодаНачислений 			= ДопПараметры.КонецПериодаНачислений;	
	
	ГраницыНачалаПериодаНачисления 	= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,НачалоПериодаНачислений,Ложь);
	
	НоваяСтрока 					= ТаблицаДней.Добавить();
	НоваяСтрока.ПериодНачисления 	= НачалоПериодаНачислений;
	НоваяСтрока.ЗавершениеОП 		= ГраницыНачалаПериодаНачисления.ЗавершениеОП;
	НоваяСтрока.ДнейВМесяце 		= РассчитатьКолвоДней(ГраницыНачалаПериодаНачисления.ЗавершениеОП , ГраницыНачалаПериодаНачисления.НачалоОП);//День(КонецМесяца(НачалоПериодаНачислений));//
	
	Если ПерваяСтрока Тогда		
		НоваяСтрока.КоличествоДнейРаботы 	= РассчитатьКолвоДней(НачалоДня(ГраницыНачалаПериодаНачисления.ЗавершениеОП -1), ПериодС);
		ПерваяСтрока 						= Ложь;
	ИначеЕсли НачалоПериодаНачислений = КонецПериодаНачислений Тогда		
		НоваяСтрока.КоличествоДнейРаботы 	= РассчитатьКолвоДней(НачалоДня((КонецДня(ПериодПо) + 1)), ГраницыНачалаПериодаНачисления.НачалоОП);
	Иначе 		
		НоваяСтрока.КоличествоДнейРаботы 	= РассчитатьКолвоДней(ГраницыНачалаПериодаНачисления.ЗавершениеОП , ГраницыНачалаПериодаНачисления.НачалоОП);//НоваяСтрока.ДнейВМесяце;//
	КонецЕсли;
	
КонецФункции

Функция РассчитатьКолвоДней(ПерваяДата, ВтораяДата) Экспорт 			
	Возврат (ПерваяДата - ВтораяДата) / (60 * 60 * 24);
КонецФункции

#КонецОбласти


#Область ФормированиеПечатнойФормы

Функция СформироватьТабДок(Объект,Элементы) Экспорт
	ТабДок 							= Новый ТабличныйДокумент; 
	ТабДок2 						= Новый ТабличныйДокумент;
	МенеджерДокумента 				= Документы.энргАктНесанкционированногоПодключенияВмешательства;
	ОписаниеДопПараметров			= "Организация, НачалоПериодаНачислений, КонецПериодаНачислений, ПериодС, ПериодПо, Район";
	
	НачалоПериодаНачислений 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.НачалоПотребления, Объект.Организация,Объект.Район);
	КонецПериодаНачислений 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.ОкончаниеПотребления, Объект.Организация,Объект.Район);
	
	
	ТаблицаДней = Новый ТаблицаЗначений;
	ТаблицаДней.Колонки.Добавить("ПериодНачисления"		, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("ЗавершениеОП"			, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("КоличествоДнейРаботы"	, ОбщегоНазначения.ОписаниеТипаЧисло(2));	
	ТаблицаДней.Колонки.Добавить("ДнейВМесяце"			, ОбщегоНазначения.ОписаниеТипаЧисло(2));	
	
	Если НачалоПериодаНачислений = КонецПериодаНачислений Тогда
		ДопПараметры = Новый Структура(ОписаниеДопПараметров, Объект.Организация, НачалоПериодаНачислений, КонецПериодаНачислений, Объект.НачалоПотребления, Объект.ОкончаниеПотребления, Объект.Район);
		МенеджерДокумента.ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ТаблицаДней, ДопПараметры);
	Иначе
		ПерваяСтрока = Истина;
		Пока НачалоПериодаНачислений <= КонецПериодаНачислений Цикл
			ДопПараметры 			= Новый Структура(ОписаниеДопПараметров, Объект.Организация, НачалоПериодаНачислений, КонецПериодаНачислений, Объект.НачалоПотребления, Объект.ОкончаниеПотребления, Объект.Район);
			МенеджерДокумента.ДобавитьЗаписиПриОтсутствииБольшеОдногоПериодаНачислений(ТаблицаДней, ДопПараметры, ПерваяСтрока);
			НачалоПериодаНачислений = ДобавитьМесяц(НачалоПериодаНачислений, 1);
		КонецЦикла;		
	КонецЕсли;
	РассчитатьОбъемНачислений(Объект,Объект.Движения.энргОбъемНачислений);
	МассивДанных =  Объект.Движения.энргОбъемНачислений;
	
	// Заполнение ПФ
	МесяцНачала = Месяц(Объект.НачалоПотребления);
	МесяцКонца = Месяц(Объект.ОкончаниеПотребления);
	ЛетМеждуДатами = Год(Объект.ОкончаниеПотребления) - Год(Объект.НачалоПотребления);
	РезультатВМесяцах = ЛетМеждуДатами * 12 - МесяцНачала + МесяцКонца;
	РазницаВДнях = Объект.ОкончаниеПотребления - Объект.НачалоПотребления;
	  
	Если РезультатВМесяцах 			= 3 И не Объект.МощностьПодключаемогоОборудования 			= 0 И Объект.КлючПомещения.ЧастныйСектор Тогда
		Макет = ПолучитьМакет("Форма43");
	ИначеЕсли РезультатВМесяцах 	< 3 И не Объект.МощностьПодключаемогоОборудования 			= 0 И Объект.КлючПомещения.ЧастныйСектор Тогда
		Макет = ПолучитьМакет("Форма43_1");		
	ИначеЕсли РезультатВМесяцах 	= 3 И не Объект.МощностьПодключаемогоОборудования 			= 0 И Объект.КлючПомещения.Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда
		Макет = ПолучитьМакет("Форма41");
	ИначеЕсли РезультатВМесяцах 	< 3 И не Объект.МощностьПодключаемогоОборудования 			= 0 И Объект.КлючПомещения.Строение.ТипСтроения = Перечисления.энргТипыСтроений.МКД Тогда
		Макет = ПолучитьМакет("Форма41_1");
	ИначеЕсли  РезультатВМесяцах	= 3 И Элементы.МощностьПодключаемогоОборудования.Видимость 	= Ложь Тогда
		Макет = ПолучитьМакет("Форма40");
	ИначеЕсли РезультатВМесяцах 	< 3 И Элементы.МощностьПодключаемогоОборудования.Видимость 	= Ложь Тогда
		Макет = ПолучитьМакет("Форма40_1");
	ИначеЕсли РезультатВМесяцах 	= 3 И Объект.МощностьПодключаемогоОборудования 				= 0 Тогда
		Макет = ПолучитьМакет("Форма42");
	ИначеЕсли РезультатВМесяцах 	< 3 И Объект.МощностьПодключаемогоОборудования 				= 0  Тогда
		Макет = ПолучитьМакет("Форма42_1");		
		
	КонецЕсли;
	
	СтруктураДляОбластьТЧВерх = Новый Структура;
	СтруктураДляОбластьТЧВерх.Вставить("НачалоПериода"    , Объект.НачалоПотребления);
	СтруктураДляОбластьТЧВерх.Вставить("ОкончаниеПериода" , Объект.ОкончаниеПотребления);
	СтруктураДляОбластьТЧВерх.Вставить("РазницаДней"      , РазницаВДнях / 86400);
	СтруктураДляОбластьТЧВерх.Вставить("Мощность"         , Объект.МощностьПодключаемогоОборудования);
	СтруктураДляОбластьТЧВерх.Вставить("РезультатВМесяцах", РезультатВМесяцах);
	СтруктураДляОбластьТЧВерх.Вставить("Норматив"         , МассивДанных[0].НормаПотребления);
	
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ЗаполнитьОбластьЗаголовок(ОбластьЗаголовок, Объект);	
	ТабДок.Вывести (ОбластьЗаголовок);
	
	ОбластьШапка 							= Макет.ПолучитьОбласть("ОбластьШапка");
	Адрес =  ПолучитьАдресАбонентаПоКлючу(Объект.КлючПомещения);	
	ОбластьШапка.Параметры.Потребитель  	= Объект.Абонент;
	ОбластьШапка.Параметры.ЛицевойСчет  	= Объект.Абонент.ЛицевойСчет;
	ОбластьШапка.Параметры.Адрес 			= Адрес;
	ТабДок.Вывести (ОбластьШапка);
	
	ОбластьТЧВерх 							= Макет.ПолучитьОбласть("ОбластьТЧВерх");
	ОбластьТЧВерх.Параметры.Заполнить(СтруктураДляОбластьТЧВерх);	
	ТабДок.Вывести (ОбластьТЧВерх); 	
	
	ОбластьТело 							= Макет.ПолучитьОбласть("ОбластьТело"); 	
	ТабДок.Вывести (ОбластьТело);
	
	СтруктураОбластьКолонки = Новый Структура;
	СуммаВсего = 0;
	Для Каждого Элемент Из МассивДанных Цикл
		ОбластьТЧКолонки 		=  Макет.ПолучитьОбласть("ОбластьКолонки");		
		СуммаЗадолженности 		=  ОпределитьЗадолженностьНаПериод(ТаблицаДней[Элемент.НомерСтроки-1].ЗавершениеОП - 1, Объект.Организация, Объект.Район, Объект.Абонент);
		ОбъемЗаРасчетныйПериод	=  СуммаЗадолженности / Элемент.ЗначениеТарифа;
		ДоначисленныйОбъем		=  Элемент.ОбъемУслуги - ОбъемЗаРасчетныйПериод;
		Если Элемент.Сумма - СуммаЗадолженности < 0 Тогда
			ОбъемЗаРасчетныйПериод = 0;
			ДоначисленныйОбъем	   = 0;
		КонецЕсли;	

		
				
		СтруктураОбластьКолонки.Вставить("СуммаДолга"			  , СуммаЗадолженности);
		СтруктураОбластьКолонки.Вставить("КоличествоДнейРаботы"	  , ТаблицаДней[Элемент.НомерСтроки-1].КоличествоДнейРаботы);
		СтруктураОбластьКолонки.Вставить("НормаПотребления"		  , Элемент.НормаПотребления / ТаблицаДней[Элемент.НомерСтроки-1].ДнейВМесяце * ТаблицаДней[Элемент.НомерСтроки-1].КоличествоДнейРаботы);
		СтруктураОбластьКолонки.Вставить("СуммаПлаты"			  , Элемент.Сумма - СуммаЗадолженности);
		СтруктураОбластьКолонки.Вставить("СуммаВсего"			  , СуммаВсего);
		СтруктураОбластьКолонки.Вставить("НачалоПериода"		  , Элемент.НачалоПериода);
		СтруктураОбластьКолонки.Вставить("КонецПериода"			  , Элемент.КонецПериода);
		СтруктураОбластьКолонки.Вставить("ОбъемУслуги"			  , Элемент.ОбъемУслуги);
		СтруктураОбластьКолонки.Вставить("ЗначениеТарифа"		  , Элемент.ЗначениеТарифа);
		СтруктураОбластьКолонки.Вставить("ОбъемЗаРасчетныйПериод" , ОбъемЗаРасчетныйПериод);
		СтруктураОбластьКолонки.Вставить("ДоначисленныйОбъем"     , ДоначисленныйОбъем);
		СтруктураОбластьКолонки.Вставить("Сумма"				  , Элемент.ОбъемУслуги * Элемент.ЗначениеТарифа);
		СтруктураОбластьКолонки.Вставить("Мощность"				  , Объект.МощностьПодключаемогоОборудования); 
		СтруктураОбластьКолонки.Вставить("КоличествоЧасов"		  , ТаблицаДней[Элемент.НомерСтроки-1].КоличествоДнейРаботы * 24);
		СтруктураОбластьКолонки.Вставить("Коэффициент"			  , Константы.энргПовышающийКоэффициентНесанкционированногоПодключения.Получить());
		
		
		ОбластьТЧКолонки.Параметры.Заполнить(СтруктураОбластьКолонки);
		СуммаВсего = СуммаВсего + Элемент.Сумма;
		
		Если Элемент.НомерСтроки-1 = МассивДанных.Количество()-1 Тогда
			ОбластьТЧКолонки.Параметры.Всего = СуммаВсего;
		КонецЕсли;
		ТабДок.Присоединить(ОбластьТЧКолонки);
	КонецЦикла;
	
	
	ОбластьПодвал 						= Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.СуммаОплаты = ОбластьТЧКолонки.Параметры.Всего;
	ОбластьПодвал.Параметры.Заполнить(Объект);
	ТабДок.Вывести (ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

Функция ПолучитьАдресАбонентаПоКлючу(КлючПомещения) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(энргКлючиПомещений.Строение.Представление, """") КАК Строение,
	|	ЕСТЬNULL(энргКлючиПомещений.Помещение.Представление, """") КАК Помещение
	|ИЗ
	|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.Ссылка = &КлючПомещения";
	
	Запрос.УстановитьПараметр("КлючПомещения", КлючПомещения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Если ЗначениеЗаполнено (ВыборкаДетальныеЗаписи.Помещение) Тогда
		Адрес = ВыборкаДетальныеЗаписи.Строение + ", " + ВыборкаДетальныеЗаписи.Помещение;
	Иначе
		Адрес = ВыборкаДетальныеЗаписи.Строение;
	КонецЕсли;
	Возврат Адрес;
КонецФункции	

#КонецОбласти


#Область ФормированиеДанныхДляЗаписи

Процедура РассчитатьОбъемНачислений(Объект, Набор) Экспорт
	
	МенеджерДокумента 				= Документы.энргАктНесанкционированногоПодключенияВмешательства;
	ОписаниеДопПараметров			= "Организация, НачалоПериодаНачислений, КонецПериодаНачислений, ПериодС, ПериодПо, Район";
	
	НачалоПериодаНачислений 		= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.НачалоПотребления, Объект.Организация,Объект.Район);
	КонецПериодаНачислений 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.ОкончаниеПотребления, Объект.Организация,Объект.Район);
	
	
	ТаблицаДней = Новый ТаблицаЗначений;
	ТаблицаДней.Колонки.Добавить("ПериодНачисления"		, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("ЗавершениеОП"			, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("НачалоПериода"		, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("КонецПериода"			, ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДней.Колонки.Добавить("КоличествоДнейРаботы"	, ОбщегоНазначения.ОписаниеТипаЧисло(2));	
	ТаблицаДней.Колонки.Добавить("ДнейВМесяце"			, ОбщегоНазначения.ОписаниеТипаЧисло(2));	
	
	Если НачалоПериодаНачислений = КонецПериодаНачислений Тогда
		ДопПараметры = Новый Структура(ОписаниеДопПараметров, Объект.Организация, НачалоПериодаНачислений, КонецПериодаНачислений, Объект.НачалоПотребления, Объект.ОкончаниеПотребления, Объект.Район);
		МенеджерДокумента.ДобавитьЗаписиПриОтсутствииВГраницеТекущегоПериода(ТаблицаДней, ДопПараметры);
	Иначе
		ПерваяСтрока = Истина;
		Пока НачалоПериодаНачислений <= КонецПериодаНачислений Цикл
			ДопПараметры 			= Новый Структура(ОписаниеДопПараметров, Объект.Организация, НачалоПериодаНачислений, КонецПериодаНачислений, Объект.НачалоПотребления, Объект.ОкончаниеПотребления, Объект.Район);
			МенеджерДокумента.ДобавитьЗаписиПриОтсутствииБольшеОдногоПериодаНачислений(ТаблицаДней, ДопПараметры, ПерваяСтрока);
			НачалоПериодаНачислений = ДобавитьМесяц(НачалоПериодаНачислений, 1);
		КонецЦикла;		
	КонецЕсли;
	
	Результат 	= ПолучитьРезультатРасчета(ТаблицаДней, Объект);
	Выборка 	= Результат.Выбрать();
	Набор.Очистить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОбъемУслуги < 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРезультатРасчета(ТаблицаДней, ВспомогательныеПараметры)
	
	Запрос		 		= Новый Запрос;
	Запрос.Текст 		= ТекстЗапросаПолученияРезультатаРасчета();
	
	ЭтоВмешательство 	= ВспомогательныеПараметры.ВидОперации = Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Вмешательство;
	
	Запрос.УстановитьПараметр("ТаблицаСДнями"			, ТаблицаДней);
	Запрос.УстановитьПараметр("Дата"					, ВспомогательныеПараметры.Дата);
	Запрос.УстановитьПараметр("Ссылка"					, ВспомогательныеПараметры.Ссылка);
	Запрос.УстановитьПараметр("НачалоПотребления"		, ВспомогательныеПараметры.НачалоПотребления);
	Запрос.УстановитьПараметр("ОкончаниеПотребления"	, ВспомогательныеПараметры.ОкончаниеПотребления);
	Запрос.УстановитьПараметр("ТЧТочкиУчета"			, ВспомогательныеПараметры.Услуги.Выгрузить());
	Запрос.УстановитьПараметр("Абонент"					, ВспомогательныеПараметры.Абонент);
	Запрос.УстановитьПараметр("Организация"				, ВспомогательныеПараметры.Организация);
	Запрос.УстановитьПараметр("КлючПомещения"			, ВспомогательныеПараметры.КлючПомещения);
	Запрос.УстановитьПараметр("Помещение"				, ВспомогательныеПараметры.КлючПомещения.Помещение);
	Запрос.УстановитьПараметр("Район"					, ВспомогательныеПараметры.Район);
	Запрос.УстановитьПараметр("Строение"				, ВспомогательныеПараметры.КлючПомещения.Строение);
	Запрос.УстановитьПараметр("ЧастныйСектор"			, ВспомогательныеПараметры.КлючПомещения.ЧастныйСектор);
	Запрос.УстановитьПараметр("ПериодНачисления"		, ВспомогательныеПараметры.ПериодНачисления);
	Запрос.УстановитьПараметр("Мощность"				, ВспомогательныеПараметры.МощностьПодключаемогоОборудования);
	Запрос.УстановитьПараметр("Коэффициент"				, Константы.энргПовышающийКоэффициентНесанкционированногоПодключения.Получить());
	Запрос.УстановитьПараметр("ПолучатьОбъемыДляВычета"	, ПолучатьОбъемыДляВычета(ВспомогательныеПараметры));
	Запрос.УстановитьПараметр("ЭтоВмешательство"		, ЭтоВмешательство);
	Запрос.УстановитьПараметр("Активность"				, Истина);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Возврат РезультатЗапроса;
	
КонецФункции


Функция ТекстЗапросаПолученияРезультатаРасчета()
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСДнями.ПериодНачисления КАК ПериодНачисления,
	|	ДОБАВИТЬКДАТЕ(ТаблицаСДнями.ЗавершениеОП, СЕКУНДА, -1) КАК ЗавершениеОП,
	|	ТаблицаСДнями.КоличествоДнейРаботы КАК КоличествоДнейРаботы,
	|	ТаблицаСДнями.ДнейВМесяце КАК ДнейВМесяце
	|ПОМЕСТИТЬ ТаблицаСДнями
	|ИЗ
	|	&ТаблицаСДнями КАК ТаблицаСДнями
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСДнями.ПериодНачисления КАК ПериодНачисления
	|ПОМЕСТИТЬ ДанныеПоДням
	|ИЗ
	|	ТаблицаСДнями КАК ТаблицаСДнями
	|ГДЕ
	|	НЕ ТаблицаСДнями.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТЧТочкиУчета.НормаПотребления КАК НормаПотребления,
	|	ТЧТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТЧТочкиУчета.Поставщик КАК Поставщик,
	|	ТЧТочкиУчета.КлючНорматива КАК КлючНорматива,
	|	ТЧТочкиУчета.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ТЧТочкиУчета.Услуга КАК Услуга,
	|	ТЧТочкиУчета.ВидблагоустройстваИндивидуальный КАК ВидБлагоустройстваИндивидуальный
	|ПОМЕСТИТЬ ТЧ_ТочкиУчета
	|ИЗ
	|	&ТЧТочкиУчета КАК ТЧТочкиУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ_ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТЧ_ТочкиУчета.НормаПотребления КАК НормаПотребления,
	|	ТЧ_ТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТЧ_ТочкиУчета.Поставщик КАК Поставщик,
	|	ТЧ_ТочкиУчета.КлючНорматива КАК КлючНорматива,
	|	ТЧ_ТочкиУчета.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ТЧ_ТочкиУчета.Услуга КАК Услуга,
	|	ЗНАЧЕНИЕ(Справочник.энргТарифныеЗоны.БезРазбивки) КАК ТарифнаяЗона,
	|	ТЧ_ТочкиУчета.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройстваИндивидуальный,
	|	ТаблицаСДнями.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаСДнями.ЗавершениеОП КАК ЗавершениеОП,
	|	ТаблицаСДнями.КоличествоДнейРаботы КАК КоличествоДнейРаботы,
	|	ТаблицаСДнями.ДнейВМесяце КАК ДнейВМесяце
	|ПОМЕСТИТЬ ТочкиУчета
	|ИЗ
	|	ТЧ_ТочкиУчета КАК ТЧ_ТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСДнями КАК ТаблицаСДнями
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТочкиУчета.ПериодНачисления КАК ПериодНачисления,
	|	ТочкиУчета.Услуга КАК Услуга
	|ПОМЕСТИТЬ Шапка
	|ИЗ
	|	ТочкиУчета КАК ТочкиУчета
	|ГДЕ
	|	НЕ ТочкиУчета.ПериодНачисления = &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Шапка.ПериодНачисления КАК ПериодНачисления,
	|	Шапка.Услуга КАК Услуга,
	|	СУММА(энргОбъемНачислений.ОбъемУслуги) КАК ОбъемУслуги
	|ПОМЕСТИТЬ ОбъемыДляВычета
	|ИЗ
	|	Шапка КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|		ПО Шапка.ПериодНачисления = энргОбъемНачислений.ПериодНачисления
	|			И Шапка.Услуга = энргОбъемНачислений.Услуга
	|			И (энргОбъемНачислений.Организация = &Организация)
	|			И (энргОбъемНачислений.Район = &Район)
	|			И (НЕ энргОбъемНачислений.Распределение)
	|			И (энргОбъемНачислений.Строение = &Строение)
	|			И (энргОбъемНачислений.Помещение = &Помещение)
	|			И (энргОбъемНачислений.Абонент = &Абонент)
	|			И (энргОбъемНачислений.ЧастныйСектор = &ЧастныйСектор)
	|			И (НЕ энргОбъемНачислений.Регистратор = &Ссылка)
	|			И (&ПолучатьОбъемыДляВычета)
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.ПериодНачисления,
	|	Шапка.Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргЗначенияТарифов.Период КАК Период,
	|	энргЗначенияТарифов.ГруппаПотребителей КАК ГруппаПотребителей,
	|	энргЗначенияТарифов.Услуга КАК Услуга,
	|	энргЗначенияТарифов.Поставщик КАК Поставщик,
	|	энргЗначенияТарифов.ТарифнаяЗона КАК ТарифнаяЗона,
	|	энргЗначенияТарифов.Значение КАК Значение
	|ПОМЕСТИТЬ ЗначенияТарифовСписок
	|ИЗ
	|	ТочкиУчета КАК ТочкиУчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргЗначенияТарифов КАК энргЗначенияТарифов
	|		ПО ТочкиУчета.ГруппаПотребителей = энргЗначенияТарифов.ГруппаПотребителей
	|			И ТочкиУчета.Услуга = энргЗначенияТарифов.Услуга
	|			И ТочкиУчета.Поставщик = энргЗначенияТарифов.Поставщик
	|			И ТочкиУчета.ТарифнаяЗона = энргЗначенияТарифов.ТарифнаяЗона
	|			И (энргЗначенияТарифов.Организация = &Организация)
	|			И (энргЗначенияТарифов.Район = &Район)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиУчета.НормаПотребления КАК НормаПотребления,
	|	ТочкиУчета.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ТочкиУчета.Поставщик КАК Поставщик,
	|	ТочкиУчета.КлючНорматива КАК КлючНорматива,
	|	ТочкиУчета.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ТочкиУчета.Услуга КАК Услуга,
	|	ТочкиУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ТочкиУчета.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройстваИндивидуальный,
	|	ТочкиУчета.ПериодНачисления КАК ПериодНачисления,
	|	ТочкиУчета.ЗавершениеОП КАК ЗавершениеОП,
	|	ТочкиУчета.КоличествоДнейРаботы КАК КоличествоДнейРаботы,
	|	ТочкиУчета.ДнейВМесяце КАК ДнейВМесяце,
	|	ЕСТЬNULL(ВложенныйЗапрос.Значение, 1) КАК ЗначениеТарифа,
	|	&НачалоПотребления КАК НачалоПотребления,
	|	&ОкончаниеПотребления КАК ОкончаниеПотребления
	|ПОМЕСТИТЬ ОбщиеДанные
	|ИЗ
	|	ТочкиУчета КАК ТочкиУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.ГруппаПотребителей КАК ГруппаПотребителей,
	|			ВложенныйЗапрос.Услуга КАК Услуга,
	|			ВложенныйЗапрос.Поставщик КАК Поставщик,
	|			ВложенныйЗапрос.ТарифнаяЗона КАК ТарифнаяЗона,
	|			ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|			ЗначенияТарифовСписок.Значение КАК Значение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТочкиУчета.ГруппаПотребителей КАК ГруппаПотребителей,
	|				ТочкиУчета.Услуга КАК Услуга,
	|				ТочкиУчета.Поставщик КАК Поставщик,
	|				МАКСИМУМ(ЗначенияТарифовСписок.Период) КАК Период,
	|				ЗначенияТарифовСписок.ТарифнаяЗона КАК ТарифнаяЗона,
	|				ТочкиУчета.ПериодНачисления КАК ПериодНачисления
	|			ИЗ
	|				ЗначенияТарифовСписок КАК ЗначенияТарифовСписок
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТочкиУчета КАК ТочкиУчета
	|					ПО ЗначенияТарифовСписок.ГруппаПотребителей = ТочкиУчета.ГруппаПотребителей
	|						И ЗначенияТарифовСписок.Услуга = ТочкиУчета.Услуга
	|						И ЗначенияТарифовСписок.Поставщик = ТочкиУчета.Поставщик
	|						И ЗначенияТарифовСписок.ТарифнаяЗона = ТочкиУчета.ТарифнаяЗона
	|						И ЗначенияТарифовСписок.Период <= ТочкиУчета.ЗавершениеОП
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ЗначенияТарифовСписок.ТарифнаяЗона,
	|				ТочкиУчета.Услуга,
	|				ТочкиУчета.ГруппаПотребителей,
	|				ТочкиУчета.Поставщик,
	|				ТочкиУчета.ПериодНачисления) КАК ВложенныйЗапрос
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияТарифовСписок КАК ЗначенияТарифовСписок
	|				ПО ВложенныйЗапрос.Период = ЗначенияТарифовСписок.Период
	|					И ВложенныйЗапрос.ГруппаПотребителей = ЗначенияТарифовСписок.ГруппаПотребителей
	|					И ВложенныйЗапрос.Услуга = ЗначенияТарифовСписок.Услуга
	|					И ВложенныйЗапрос.Поставщик = ЗначенияТарифовСписок.Поставщик
	|					И ВложенныйЗапрос.ТарифнаяЗона = ЗначенияТарифовСписок.ТарифнаяЗона) КАК ВложенныйЗапрос
	|		ПО ТочкиУчета.ГруппаПотребителей = ВложенныйЗапрос.ГруппаПотребителей
	|			И ТочкиУчета.Услуга = ВложенныйЗапрос.Услуга
	|			И ТочкиУчета.Поставщик = ВложенныйЗапрос.Поставщик
	|			И ТочкиУчета.ТарифнаяЗона = ВложенныйЗапрос.ТарифнаяЗона
	|			И ТочкиУчета.ПериодНачисления = ВложенныйЗапрос.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Абонент КАК Абонент,
	|	&Организация КАК Организация,
	|	&Помещение КАК Помещение,
	|	&Район КАК Район,
	|	&Строение КАК Строение,
	|	&ЧастныйСектор КАК ЧастныйСектор,
	|	&ПериодНачисления КАК ПериодРасчета,
	|	&КлючПомещения КАК КлючПомещения,
	|	ОбщиеДанные.ТочкаУчета КАК ТочкаУчета,
	|	ОбщиеДанные.НормаПотребления КАК НормаПотребления,
	|	ОбщиеДанные.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ОбщиеДанные.Поставщик КАК Поставщик,
	|	ОбщиеДанные.КлючНорматива КАК КлючНорматива,
	|	ОбщиеДанные.ГруппаПотребителей КАК ТарифнаяГруппа,
	|	ОбщиеДанные.Услуга КАК Услуга,
	|	ОбщиеДанные.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ОбщиеДанные.ВидБлагоустройстваИндивидуальный КАК ВидБлагоустройства,
	|	ОбщиеДанные.ПериодНачисления КАК ПериодНачисления,
	|	ОбщиеДанные.ЗавершениеОП КАК ЗавершениеОП,
	|	ОбщиеДанные.КоличествоДнейРаботы КАК КоличествоДнейРаботы,
	|	ОбщиеДанные.ДнейВМесяце КАК ДнейВМесяце,
	|	&Активность КАК Активность,
	|	ОбщиеДанные.ЗначениеТарифа КАК ЗначениеТарифа,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыНачислений.Перерасчет) КАК ВидНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.энргСпособНачислений.ПоНормативу) КАК СпособНачисления,
	|	%1 КАК ОбъемУслуги,
	|	%1 * ОбщиеДанные.ЗначениеТарифа КАК Сумма,
	| 	ВЫБОР 
	|	КОГДА НачалоПериода(ОбщиеДанные.НачалоПотребления, Месяц) = НачалоПериода(ОбщиеДанные.ПериодНачисления, Месяц) ТОГДА
	| 	ОбщиеДанные.НачалоПотребления ИНАЧЕ  ДобавитьКДате(ОбщиеДанные.ЗавершениеОП, Месяц, -1) 
	|	КОНЕЦ КАК НачалоПериода,
	| 	ВЫБОР 
	|	КОГДА НачалоПериода(ОбщиеДанные.ОкончаниеПотребления, Месяц) = НачалоПериода(ОбщиеДанные.ПериодНачисления, Месяц) ТОГДА
	| 	ОбщиеДанные.ОкончаниеПотребления ИНАЧЕ  ОбщиеДанные.ЗавершениеОП 
	|	КОНЕЦ КАК КонецПериода
	|ИЗ
	|	ОбщиеДанные КАК ОбщиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбъемыДляВычета КАК ОбъемыДляВычета
	|		ПО ОбщиеДанные.ПериодНачисления = ОбъемыДляВычета.ПериодНачисления
	|			И ОбщиеДанные.Услуга = ОбъемыДляВычета.Услуга
	|ГДЕ 
	|	%1 >= 0";
	
	
	ОпределениеОбъема = ОпределениеОбъемаПотребления();
	Текст = СтрШаблон(Текст, ОпределениеОбъема); 
	
	Возврат Текст;
КонецФункции

Функция ОпределениеОбъемаПотребления()
	Текст = 
	"ВЫБОР
	|		КОГДА &ЭтоВмешательство
	|			ТОГДА ВЫБОР
	|					КОГДА ОбщиеДанные.ДнейВМесяце * ОбщиеДанные.КоличествоДнейРаботы * &Коэффициент - ЕСТЬNULL(ОбъемыДляВычета.ОбъемУслуги, 0) = 0
	|						ТОГДА 0
	|					ИНАЧЕ ОбщиеДанные.НормаПотребления / ОбщиеДанные.ДнейВМесяце * ОбщиеДанные.КоличествоДнейРаботы * &Коэффициент - ЕСТЬNULL(ОбъемыДляВычета.ОбъемУслуги, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &Мощность > 0
	|					ТОГДА ОбщиеДанные.КоличествоДнейРаботы * 24 * &Мощность
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ОбщиеДанные.ДнейВМесяце * ОбщиеДанные.КоличествоДнейРаботы * &Коэффициент = 0
	|							ТОГДА 0
	|						ИНАЧЕ ОбщиеДанные.НормаПотребления / ОбщиеДанные.ДнейВМесяце * ОбщиеДанные.КоличествоДнейРаботы * &Коэффициент
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ";
	
	Возврат Текст
КонецФункции

Функция ОпределитьЗадолженностьНаПериод(Период,Организация,Район,Абонент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчеты.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
		|ГДЕ
		|	энргВзаиморасчеты.Период 		= &Период
		|	И энргВзаиморасчеты.Организация = &Организация
		|	И энргВзаиморасчеты.Район 		= &Район
		|	И энргВзаиморасчеты.Абонент 	= &Абонент";
	
	Запрос.УстановитьПараметр("Абонент"		, Абонент);
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("Период"		, Период);
	Запрос.УстановитьПараметр("Район"		, Район);
	Задолженность							= 0;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 		
	Задолженность = ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;

	Возврат Задолженность;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

Функция ОпределитьНачалоПериода(КонецПериода, Организация, Район, КлючПомещения) Экспорт	
	
	НачалоПериода = ДобавитьМесяц(КонецПериода, -3);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(энргДатыПоверкиПрибораУчета.ДатаПоверки) КАК ДатаПоверки,
		|	энргДатыПоверкиПрибораУчета.КлючПомещения КАК КлючПомещения
		|ПОМЕСТИТЬ ДанныеДопускаВПомещения
		|ИЗ
		|	РегистрСведений.энргДатыПоверкиПрибораУчета КАК энргДатыПоверкиПрибораУчета
		|ГДЕ
		|	энргДатыПоверкиПрибораУчета.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И энргДатыПоверкиПрибораУчета.Организация = &Организация
		|	И энргДатыПоверкиПрибораУчета.Район = &Район
		|	И энргДатыПоверкиПрибораУчета.КлючПомещения = &КлючПомещения
		|
		|СГРУППИРОВАТЬ ПО
		|	энргДатыПоверкиПрибораУчета.КлючПомещения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МАКСИМУМ(энргСостояниеПриборовУчетаАбонента.Период),
		|	энргСостояниеПриборовУчетаАбонента.КлючПомещения
		|ИЗ
		|	РегистрСведений.энргСостояниеПриборовУчетаАбонента КАК энргСостояниеПриборовУчетаАбонента
		|ГДЕ
		|	энргСостояниеПриборовУчетаАбонента.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И энргСостояниеПриборовУчетаАбонента.Организация = &Организация
		|	И энргСостояниеПриборовУчетаАбонента.Район = &Район
		|	И энргСостояниеПриборовУчетаАбонента.КлючПомещения = &КлючПомещения
		|
		|СГРУППИРОВАТЬ ПО
		|	энргСостояниеПриборовУчетаАбонента.КлючПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеДопускаВПомещения.ДатаПоверки) КАК ДатаПоверки
		|ИЗ
		|	ДанныеДопускаВПомещения КАК ДанныеДопускаВПомещения";
	
	Запрос.УстановитьПараметр("КонецПериода"	, КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоПериода);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Район"			, Район);
	Запрос.УстановитьПараметр("КлючПомещения"	, КлючПомещения);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачалоПериода = Выборка.ДатаПоверки;
	КонецЦикла;
	
	Возврат НачалоПериода;
			
КонецФункции

Процедура ЗаполнитьПриборыУчетаСервер(Объект, ТекущиеДанные, УслугиТочекУчета, ПоставщикиУслугТочекУчета) Экспорт 
	
	Результат 							= Обработки.энргСостояниеТочекУчетаМенеджер.ДействующиеТочкиИИхПриборы(Объект.Дата, Объект.Организация, Объект.Район, Объект.КлючПомещения, ТекущиеДанные.ТочкаУчета); 
	СоставнаяУслуга 					= Неопределено;
	ЭтоСоставнаяУслуга					= Ложь;
	мТарифныеЗоны 						= Новый Массив;
	
	Если Не Результат.Пустой() Тогда
		Выборка 						= Результат.Выбрать();
		ЕстьСледующий 					= Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Выборка);//,"ПриборУчета, НаправлениеИспользованияТУ");		
		Если ЗначениеЗаполнено(Выборка.Услуга) Тогда			
			Если Выборка.СоставнаяУслуга Тогда
				СоставнаяУслуга 		= Выборка.Услуга;
				ЭтоСоставнаяУслуга		= Истина;
			Иначе
				СоотвествиеТочкаУчета 	= Новый Соответствие;
				мУслуги 				= Новый Массив;
				мУслуги.Добавить(Выборка.Услуга);
				СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, мУслуги); 		
				УслугиТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);
				ТекущиеДанные.Услуга 	= Выборка.Услуга;
			КонецЕсли;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Поставщик) и Не ЭтоСоставнаяУслуга Тогда
			КлючЗначение  				= Новый Соответствие;
			КлючЗначение.Вставить(Выборка.Услуга, Выборка.Поставщик);
			СоотвествиеТочкаУчета 		= Новый Соответствие;
			СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, КлючЗначение); 
			ПоставщикиУслугТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);
			ТекущиеДанные.Поставщик 	= Выборка.Поставщик;
		КонецЕсли;
		
		Пока ЕстьСледующий Цикл
			мТарифныеЗоны.Добавить(Выборка.ТарифнаяЗона);
			ЕстьСледующий 				= Выборка.Следующий();
		КонецЦикла;	
		
		Если мТарифныеЗоны.Количество() = 1 Тогда
			ТекущиеДанные.тарифнаяЗона 	= мТарифныеЗоны[0];
		КонецЕсли; 	
		
	КонецЕсли; 	
	
	Если НЕ СоставнаяУслуга = Неопределено Тогда
		
		ПараметрыСоставнойУслуги		= Новый Структура;
		Схема 							= Неопределено;
		ПараметрыВТ 					= Новый Массив;
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Организация", 	"Организация"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно",	Новый Структура("Район", 			"Район"), 			Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", 	Новый Структура("ТочкаУчета", 		"ТочкаУчета"), 		Неопределено));
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке", 	Новый Структура("Услуга",	 		"Услуги"), 			Неопределено));		
		
		ПараметрыСоставнойУслуги.Вставить("Период", 			Новый Структура("ИмяПараметра", "Период"));
		ПараметрыСоставнойУслуги.Вставить("ПараметрыВТ", 		ПараметрыВТ);
		
		мЧастиУслуг 					= Новый Массив;
		СоставляющиеУслуги 				= СоставнаяУслуга.СоставляющиеУслуг;
		Для Каждого СтрокаТабЧасти Из  СоставляющиеУслуги Цикл
			мЧастиУслуг.Добавить(СтрокаТабЧасти.Услуга);
		КонецЦикла;
		
		РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиСоставнойУслуги(Схема,ПараметрыСоставнойУслуги,"");
		Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
		Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
		Запрос.УстановитьПараметр("Район", 			Объект.Район);
		Запрос.УстановитьПараметр("КлючПомещения", 	Объект.КлючПомещения);
		Запрос.УстановитьПараметр("ТочкаУчета", 	ТекущиеДанные.ТочкаУчета);
		Запрос.УстановитьПараметр("Услуги", 		мЧастиУслуг);
		Запрос.УстановитьПараметр("Период", 		ТекущиеДанные.ПериодНачисления);		
		Результат 						= Запрос.Выполнить();
		Выборка 						= Результат.Выбрать();
		мУслуги 						= Новый Массив;
		КлючЗначение  					= Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			мУслуги.Добавить(Выборка.Услуга);			
			КлючЗначение.Вставить(Выборка.Услуга, Выборка.Поставщик);			
		КонецЦикла; 
		СоотвествиеТочкаУчета 		= Новый Соответствие;
		СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, КлючЗначение);
		ПоставщикиУслугТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);
		
		СоотвествиеТочкаУчета 	= Новый Соответствие; 
		СоотвествиеТочкаУчета.Вставить(ТекущиеДанные.ТочкаУчета, мУслуги);
		УслугиТочекУчета.Вставить(ТекущиеДанные.ПериодНачисления, СоотвествиеТочкаУчета);		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучатьОбъемыДляВычета(ИсточникДанных) Экспорт 
	ЭтоВмешательство = Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Вмешательство;	
	Возврат ИсточникДанных.ВидОперации = ЭтоВмешательство;
КонецФункции 

Процедура ЗаполнитьОбластьЗаголовок(ОбластьЗаголовок, Объект)
	Результат 	  = ПолучитьДанныеБанка(Объект);
	Выборка  	  = Результат.Выбрать();
	Выборка.Следующий(); 	
	
	ДанныеБанка 	= "Получатель платежа: %1 ИНН %2
	|р/с %3 в %4, 
	|к/с %5 БИК %6";
	
	АдресОтделения  = "Адрес отделения: %1
	|тел, %2
	|%3";

	
	ОбластьДанныеБанка = СтрШаблон(
		ДанныеБанка, Выборка.ОрганизацияПредставление, Выборка.ИНН, Выборка.РасчетныйСчет, СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.Банк, 6),
		Выборка.КоррСчет, Выборка.Бик); 
		
	ОбластьАдресОтделения = СтрШаблон(АдресОтделения, Выборка.АдресРайона, Выборка.ТелефонРайона, Выборка.СайтОрганизации); 

	
	ОбластьЗаголовок.Параметры.ДанныеБанка 	  = ОбластьДанныеБанка;
	ОбластьЗаголовок.Параметры.АдресОтделения = ОбластьАдресОтделения;
	ОбластьЗаголовок.Параметры.НомерАкта      = Объект.НомерАкта;
	ОбластьЗаголовок.Параметры.ДатаАкта 	  = Формат(Объект.ДатаАкта,"ДФ=dd.MM.yyyy");
КонецПроцедуры

Функция ПолучитьДанныеБанка(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК ПочтовыйАдресОрганизации,
		|	Организации.ИНН КАК ИННОрганизации,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)
		|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СайтОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК СайтОрганизации,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОрганизацииКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|					И ОрганизацииКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации)
		|				ТОГДА ОрганизацииКонтактнаяИнформация.Представление
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК ТелефонОрганизации,
		|	Организации.ОсновнойБанковскийСчет КАК СчетОрганизации,
		|	КлассификаторБанков.Код КАК БИК,
		|	БанковскиеСчета.НомерСчета КАК НомерСчета,
		|	БанковскиеСчета.Банк КАК Банк,
		|	Организации.Представление КАК Представление
		|ПОМЕСТИТЬ ДанныеОрганизации
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
		|		ПО Организации.Ссылка = ОрганизацииКонтактнаяИнформация.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
		|			ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
		|		ПО Организации.ОсновнойБанковскийСчет = БанковскиеСчета.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рксОрганизацииДополнительныеРеквизиты КАК рксОрганизацииДополнительныеРеквизиты
		|		ПО Организации.Ссылка = рксОрганизацииДополнительныеРеквизиты.Организация
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.ИНН,
		|	Организации.Ссылка,
		|	КлассификаторБанков.Код,
		|	Организации.ОсновнойБанковскийСчет,
		|	БанковскиеСчета.НомерСчета,
		|	БанковскиеСчета.Банк,
		|	Организации.Представление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗоныОтвественностиКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	энргЗоныОтвественностиКонтактнаяИнформация.Представление КАК Значение
		|ПОМЕСТИТЬ АдресРайона
		|ИЗ
		|	Справочник.энргЗоныОтвественности.КонтактнаяИнформация КАК энргЗоныОтвественностиКонтактнаяИнформация
		|ГДЕ
		|	энргЗоныОтвественностиКонтактнаяИнформация.Ссылка = &Район
		|	И энргЗоныОтвественностиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И энргЗоныОтвественностиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресРайона)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗоныОтвественности.Ссылка КАК Район,
		|	КлассификаторБанков.Наименование КАК НаименованиеБанка,
		|	БанковскиеСчета.НомерСчета КАК НомерСчета,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА энргЗоныОтвественностиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|					И энргЗоныОтвественностиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРайона)
		|				ТОГДА энргЗоныОтвественностиКонтактнаяИнформация.Представление
		|			ИНАЧЕ """"
		|		КОНЕЦ) КАК ТелефонРайона,
		|	МАКСИМУМ(энргЗоныОтвественности.КодРайона) КАК КодРайона,
		|	энргЗоныОтвественности.Организация КАК Организация
		|ПОМЕСТИТЬ ДанныеРайона
		|ИЗ
		|	Справочник.энргЗоныОтвественности КАК энргЗоныОтвественности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЗоныОтвественности.КонтактнаяИнформация КАК энргЗоныОтвественностиКонтактнаяИнформация
		|		ПО энргЗоныОтвественности.Ссылка = энргЗоныОтвественностиКонтактнаяИнформация.Ссылка,
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторБанков КАК КлассификаторБанков
		|		ПО БанковскиеСчета.Банк = КлассификаторБанков.Ссылка
		|ГДЕ
		|	энргЗоныОтвественности.Ссылка = &Район
		|
		|СГРУППИРОВАТЬ ПО
		|	энргЗоныОтвественности.Ссылка,
		|	КлассификаторБанков.Наименование,
		|	БанковскиеСчета.НомерСчета,
		|	энргЗоныОтвественности.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРайона.Район КАК Район,
		|	ДанныеРайона.Организация КАК Организация,
		|	МАКСИМУМ(ДанныеОрганизации.ТелефонОрганизации) КАК ТелефонОрганизации,
		|	МАКСИМУМ(ДанныеОрганизации.СайтОрганизации) КАК СайтОрганизации,
		|	МАКСИМУМ(ДанныеОрганизации.ПочтовыйАдресОрганизации) КАК ПочтовыйАдресОрганизации,
		|	ДанныеОрганизации.ИННОрганизации КАК ИНН,
		|	ДанныеРайона.НомерСчета КАК РасчетныйСчет,
		|	ДанныеРайона.НаименованиеБанка КАК НаименованиеБанка,
		|	ДанныеОрганизации.НомерСчета КАК КоррСчет,
		|	ДанныеОрганизации.БИК КАК БИК,
		|	ДанныеРайона.КодРайона КАК КодРайона,
		|	ДанныеРайона.ТелефонРайона КАК ТелефонРайона,
		|	ДанныеОрганизации.Банк КАК Банк,
		|	ДанныеОрганизации.Представление КАК Представление
		|ПОМЕСТИТЬ ОбщаяИнформацияПоОрганизацииИПоРайону
		|ИЗ
		|	ДанныеОрганизации КАК ДанныеОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРайона КАК ДанныеРайона
		|		ПО ДанныеОрганизации.Организация = ДанныеРайона.Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеОрганизации.ИННОрганизации,
		|	ДанныеОрганизации.БИК,
		|	ДанныеОрганизации.НомерСчета,
		|	ДанныеРайона.НаименованиеБанка,
		|	ДанныеРайона.НомерСчета,
		|	ДанныеРайона.КодРайона,
		|	ДанныеРайона.Организация,
		|	ДанныеРайона.Район,
		|	ДанныеРайона.ТелефонРайона,
		|	ДанныеОрганизации.Банк,
		|	ДанныеОрганизации.Представление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(АдресРайона.Значение, """") КАК АдресРайона,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.Район КАК Район,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.Организация КАК Организация,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.ТелефонОрганизации КАК ТелефонОрганизации,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.СайтОрганизации КАК СайтОрганизации,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.ПочтовыйАдресОрганизации КАК ПочтовыйАдресОрганизации,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.ИНН КАК ИНН,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.РасчетныйСчет КАК РасчетныйСчет,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.НаименованиеБанка КАК НаименованиеБанка,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.КоррСчет КАК КоррСчет,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.БИК КАК БИК,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.КодРайона КАК КодРайона,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.ТелефонРайона КАК ТелефонРайона,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.Банк КАК Банк,
		|	ОбщаяИнформацияПоОрганизацииИПоРайону.Представление КАК ОрганизацияПредставление
		|ИЗ
		|	ОбщаяИнформацияПоОрганизацииИПоРайону КАК ОбщаяИнформацияПоОрганизацииИПоРайону
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АдресРайона КАК АдресРайона
		|		ПО ОбщаяИнформацияПоОрганизацииИПоРайону.Район = АдресРайона.Ссылка";
	
	Запрос.УстановитьПараметр("Район"		, Объект.Район);
	Запрос.УстановитьПараметр("Организация" , Объект.Организация);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли
